from tabulate import tabulate

def execute_queries(cur):
    # Відобразити всі комедії. Відсортувати фільми по рейтингу
    cur.execute("SELECT * FROM Фільми WHERE Жанр = 'Комедія' ORDER BY Рейтинг DESC")
    comedies = cur.fetchall()
    print("Комедії (відсортовані за рейтингом):")
    print(tabulate(comedies, headers=["Код_фільму", "Назва_фільму", "Жанр", "Тривалість", "Рейтинг"]))

    # Порахувати останню дату показу фільму для кожного транслювання
    cur.execute("""
        SELECT Фільми.Назва_фільму, Кінотеатри.Назва_кінотеатру, Транслювання_фільмів.Дата_початку_показів,
               Транслювання_фільмів."Термін показу (кількість днів)",
               (Транслювання_фільмів.Дата_початку_показів + INTERVAL '1 DAY' * Транслювання_фільмів."Термін показу (кількість днів)") AS Кінцева_дата_показу
        FROM Транслювання_фільмів
        JOIN Фільми ON Транслювання_фільмів.Код_фільму = Фільми.Код_фільму
        JOIN Кінотеатри ON Транслювання_фільмів.Код_кінотеатру = Кінотеатри.Код_кінотеатру
    """)
    last_show_dates = cur.fetchall()
    print("\nОстанні дати показу для кожного транслювання:")
    headers = ["Назва_фільму", "Назва_кінотеатру", "Дата_початку_показів", "Термін_показу", "Кінцева_дата_показу"]
    print(tabulate(last_show_dates, headers=headers))

    # Порахувати суму максимального прибутку для кожного кінотеатру від одного показу
    cur.execute("""
        SELECT Кінотеатри.Назва_кінотеатру,
               SUM(Фільми.Рейтинг * Кінотеатри.Ціни_на_квитки) AS Сумарний_прибуток
        FROM Транслювання_фільмів
        JOIN Фільми ON Транслювання_фільмів.Код_фільму = Фільми.Код_фільму
        JOIN Кінотеатри ON Транслювання_фільмів.Код_кінотеатру = Кінотеатри.Код_кінотеатру
        GROUP BY Кінотеатри.Назва_кінотеатру
    """)
    max_revenue = cur.fetchall()
    print("\nСумарний прибуток для кожного кінотеатру:")
    headers = ["Назва_кінотеатру", "Сумарний_прибуток"]
    print(tabulate(max_revenue, headers=headers))

    # Відобразити всі фільми заданого жанру (запит з параметром)
    genre_to_display = 'Бойовик'
    cur.execute("SELECT * FROM Фільми WHERE Жанр = %s", (genre_to_display,))
    selected_genre_films = cur.fetchall()
    print(f"\nФільми жанру '{genre_to_display}':")
    print(tabulate(selected_genre_films, headers=["Код_фільму", "Назва_фільму", "Жанр", "Тривалість", "Рейтинг"]))

    # Порахувати кількість фільмів кожного жанру (Підсумковий запит)
    cur.execute("SELECT Жанр, COUNT(*) FROM Фільми GROUP BY Жанр")
    genre_counts = cur.fetchall()
    print("\nКількість фільмів кожного жанру:")
    headers = ["Жанр", "Кількість"]
    print(tabulate(genre_counts, headers=headers))

    cur.execute("""
    SELECT Кінотеатри.Назва_кінотеатру,
           COUNT(CASE WHEN Фільми.Жанр = 'Мелодрама' THEN 1 ELSE NULL END) AS Мелодрами,
           COUNT(CASE WHEN Фільми.Жанр = 'Комедія' THEN 1 ELSE NULL END) AS Комедії,
           COUNT(CASE WHEN Фільми.Жанр = 'Бойовик' THEN 1 ELSE NULL END) AS Бойовики
    FROM Транслювання_фільмів
    JOIN Фільми ON Транслювання_фільмів.Код_фільму = Фільми.Код_фільму
    JOIN Кінотеатри ON Транслювання_фільмів.Код_кінотеатру = Кінотеатри.Код_кінотеатру
    GROUP BY Кінотеатри.Назва_кінотеатру
    """)
    genre_counts_per_theater = cur.fetchall()
    print("\nКількість фільмів кожного жанру в кожному кінотеатрі:")
    headers = ["Назва_кінотеатру", "Мелодрами", "Комедії", "Бойовики"]
    print(tabulate(genre_counts_per_theater, headers=headers))